app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "asdkasndsadasd\r\n"], ["updated_at", "2020-02-04 14:39:12.796755"], ["id", 2]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(strong(:first_name, :last_name))

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "hello wrold"], ["last_name", "asnmdfkasmd"], ["created_at", "2020-02-04 14:21:08.636378"], ["updated_at", "2020-02-04 14:21:08.636378"]]
---
    def create
        @student = Student.new(strong(:first_name, :last_name))
        @student.save